Repository: postgis/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/about_data.po
Languages: es

source: About our data
es: Acerca de los datos

source: The data for this workshop is four shapefiles for New York City, and one attribute table of sociodemographic variables. We've loaded our shapefiles as PostGIS tables and will add sociodemographic data later in the workshop.
es: Los datos para este taller constan de cuatro shapefiles de la ciudad de Nueva York y una tabla de atributos de variables sociodemográficas. Hemos cargado los shapefiles como tablas de PostGIS y los datos sociodemográficos se añadirán más tarde durante el taller.

source: The following describes the number of records and table attributes for each of our datasets. These attribute values and relationships are fundamental to our future analysis.
es: A continuación se describe el número de registros y la tabla de atributos para cada uno de los conjuntos de datos. Estos valores de atributos y relaciones son fundamentales para nuestros análisis posteriores.

source: To explore the nature of your tables in pgAdmin, right-click a highlighted table and select **Properties**. You will find a summary of table properties, including a list of table attributes within the **Columns** tab.
es: Para explorar la naturaleza de las tablas en pgAdmin, botón derecho en una tabla resaltada y seleccionar **Propiedades**. Aparecerá un resumen de las propiedades de la tabla, incluyendo una lista de los atriburos de la tabla dentro de la pestaña **Columnas**.

source: A census block is the smallest geography for which census data is reported. All higher level census geographies (block groups, tracts, metro areas, counties, etc) can be built from unions of census blocks. We have attached some demographic data to our collection of blocks.
es: Una manzana censal es el área geográfica más pequeña de la que se tienen datos censales. Todas las geografías censales de nivel superior (grupos de manzanas, secciones, áreas metropolitanas, condados, etc.) pueden construirse a partir de uniones de manzanas censales. Hemos adjuntado algunos datos demográficos a nuestra colección de manzanas.

source: Number of records: 38794
es: Número de registros: 38794

source: A 15-digit code that uniquely identifies every census **block**. Eg: 360050001009000
es: Un código de 15 dígitos que identifica de forma única cada **bloque** del censo. Ej: 360050001009000

source: Total number of people in the census block
es: Número total de personas en el bloque del censo

source: Number of people self-identifying as "White" in the block
es: Número de personas que se auto-identifican como "Blanco/a"

source: Number of people self-identifying as "Black" in the block
es: Número de personas que se auto-identifican con "Negro/a"

source: Number of people self-identifying as "Native American" in the block
es: Número de personas que se auto-identifican como "Nativo/a Americano/a"

source: Number of people self-identifying as "Asian" in the block
es: Número de personas que se auto-identifican como "Asiático/a"

source: Number of people self-identifying with other categories in the block
es: Número de personas que se auto-identifican como otras categorías

source: Name of the New York borough. Manhattan, The Bronx, Brooklyn, Staten Island, Queens
es: Nombre del distrito de Nueva York, Manhattan, el Bronx, Brooklyn, Staten Island, Queens

source: Polygon boundary of the block
es: Límite del bloque

source: *Black population as a percentage of Total Population*
es: *Población negra como porcentaje de la Población Total*

source: To get census data into GIS, you need to join two pieces of information: the actual data (text), and the boundary files (spatial). There are many options for getting the data, including downloading data and boundaries from the Census Bureau's `American FactFinder <http://factfinder.census.gov>`_.
es: Para introducir los datos del censo dentro del SIG, hay que unir dos piezas de información: los datos reales (texto) y los archivos de limites (espacial). Hay muchas formas para conseguir estos datos, incluyendo descargar ambos desde Census Bureau's `American FactFinder <http://factfinder.census.gov>`_.

source: New York has a rich history of neighborhood names and extent. Neighborhoods are social constructs that do not follow lines laid down by the government. For example, the Brooklyn neighborhoods of Carroll Gardens, Red Hook, and Cobble Hill were once collectively known as "South Brooklyn." And now, depending on which real estate agent you talk to, the same four blocks in the-neighborhood-formerly-known-as-Red-Hook can be referred to as Columbia Heights, Carroll Gardens West, or Red Hook!
es: Nueva York tiene una rica historia sobre los nombres y extensiones de sus barrios. Los barrios son constructos sociales que no siguen las lineas puestas por el gobierno. Por ejemplo, los barrios de Brooklyn de Carroll Gardens, Red Hook, y Cobble Hill se conocieron en cierto momento colectivamente como "Brooklyn Sur". Y ahora, en función del agente inmobiliario con el que se hable, los mismos cuatro bloques del barrio antes conocido como Red Hook ¡pueden ser Columbia Heights, Carroll Gardens West, o Red Hook!

source: Number of records: 129
es: Número de registros: 129

source: Name of the neighborhood
es: Nombre del barrio

source: Polygon boundary of the neighborhood
es: Polígono de límite del barrio

source: *The neighborhoods of New York City*
es: *Los barrios de Nueva York*

source: The street centerlines form the transportation network of the city. These streets have been flagged with types in order to distinguish between such thoroughfares as back alleys, arterial streets, freeways, and smaller streets. Desirable areas to live might be on residential streets rather than next to a freeway.
es: Las líneas centrales de las calles forman la red de transporte de la ciudad. Estas calles se han marcado con tipos para distinguir entre vías como callejones, calles arteriales, autopistas y calles más pequeñas. Las zonas deseables para vivir pueden estar en calles residenciales y no junto a una autopista.

source: Number of records: 19091
es: Número de registros: 19091

source: Name of the street
es: Nombre de la calle

source: **oneway**
es: **Un solo sentido**

source: Is the street one-way? "yes" = yes, "" = no
es: ¿La calle es de sentido único? "Yes" = sí, "" = no

source: **type**
es: **tipo**

source: Road type (primary, secondary, residential, motorway)
es: Tipo de carretera (primaria, secundaria, residencial, autopista)

source: Linear centerline of the street
es: Línea central lineal de la calle

source: *The streets of New York City. Major roads are in red.*
es: *Las calles de Nueva York. Las carreteras principales están en rojo.*

source: The subway stations link the upper world where people live to the invisible network of subways beneath. As portals to the public transportation system, station locations help determine how easy it is for different people to enter the subway system.
es: Las estaciones de metro conectan a la superficie donde vive la gente con la red invisible de subterráneos que hay debajo. Como portales del sistema de transporte público, la ubicación de las estaciones ayuda a determinar la facilidad con que distintas personas acceden al sistema de metro.

source: Number of records: 491
es: Número de registros: 491

source: Name of the station
es: Nombre de la estación

source: **borough**
es: **borough** (distrito)

source: **routes**
es: **routes** (rutas)

source: Subway lines that run through this station
es: Líneas de metro que pasan por esta estación

source: **transfers**
es: **transfers** (transbordos)

source: Lines you can transfer to via this station
es: Líneas a las que puede hacer transbordo a través de esta estación

source: **express**
es: **express**(expreso)

source: Stations where express trains stop, "express" = yes, "" = no
es: Estaciones donde paran trenes exprés, "express" = sí, "" = no

source: Point location of the station
es: Localización puntual de la estación

source: *Point locations for New York City subway stations*
es: *Localización de las estaciones de metro de Nueva York*

source: There is a rich collection of social-economic data collected during the census process, but only at the larger geography level of census tract. Census blocks combine to form census tracts (and block groups). We have collected some social-economic at a census tract level to answer some of these more interesting questions about New York City.
es: Existe una rica colección de datos socio-económicos recopilados durante el censo, pero sólo a nivel geográfico más amplio de sección censal. Las manzanas censales se combinan para formar secciones censales (grupos de manzanas). Hemos recopilado algunos datos socio-económicos a nivel de sección censal para responder a algunas de las preguntas más interesantes sobre la ciudad de Nueva York.

source: The ``nyc_census_sociodata`` is a data table. We will need to connect it to Census geographies before conducting any spatial analysis.
es: El ``nyc_census_sociodata`` es una tabla de datos. Tendremos que conectarla a las geografías del Censo antes de realizar cualquier análisis espacial.

source: **tractid**
es: **tractid** (Id de la zona censal)

source: An 11-digit code that uniquely identifies every census **tract**. ("36005000100")
es: Un código de 11 dígitos que identifica unívocamente cada **conjunto censal**. ("36005000100")

source: **transit_total**
es: **transit_total** (tránsito total)

source: Number of workers in the tract
es: Número de trabajadores en la zona censal

source: **transit_private**
es: **transit_private** (tránsito privado)

source: Number of workers in the tract who use private automobiles / motorcycles
es: Número de trabajadores de la zona que utilizan automóviles privados / motocicletas

source: **transit_public**
es: **transit_public** (tránsito público)

source: Number of workers in the tract who take public transit
es: Número de trabajadores de la zona que utilizan el transporte público

source: **transit_walk**
es: **transit_walk** (tránsito peatonal)

source: Number of workers in the tract who walk
es: Número de trabajadores de la zona que van a pie

source: **transit_other**
es: **transit_other** (otros tipos de tránsito)

source: Number of workers in the tract who use other forms like walking / biking
es: Número de trabajadores en el tramo que utilizan otras formas como caminar / ir en bicicleta

source: **transit_none**
es: **transit_none** ( sin tránsito)

source: Number of workers in the tract who work from home
es: Número de trabajadores de la zona que trabajan desde casa

source: Total number of minutes spent in transit by all workers in the tract (minutes)
es: Número total de minutos dedicados al transporte por todos los trabajadores en la zona censal (minutos)

source: Number of families in the tract
es: Número de familias en la zona censal

source: **family_income_median**
es: **family_income_median** (Media de ingresos por familia)

source: Median family income in the tract (dollars)
es: Ingreso familiar mediano en la zona censal (dólares)

source: Average family income in the tract (dollars)
es: Ingreso familiar promedio en la zona censal (dólares)

source: Total income of all families in the tract (dollars)
es: Ingreso total de todas las familias en la zona censal (dólares)

source: Number of people with educational history
es: Número de personas con historial educativo

source: Number of people with no high school diploma
es: Número de personas sin diploma de secundaria

source: Number of people with high school diploma and no further education
es: Número de personas con diploma de secundaria y sin educación posterior

source: Number of people with college diploma and no further education
es: Número de personas con diploma universitario

source: Number of people with graduate school diploma
es: Número de personas con diploma de posgrado
