Repository: postgis/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/installation.po
Languages: es, ko, zh_hans

source: Installation
es: Instalación
ko: 설치
zh_hans: 安装

source: To explore the PostgreSQL/PostGIS database, and learn about writing spatial queries in SQL, we will need some software, either installed locally or available remotely on the cloud.
es: Para explorar una base de datos PostgreSQL/PostGIS, y aprender a escribir consultas SQL espaciales, necesitamos algo de software que podrá estar instalado en local, o bien disponible en la nube.
ko: PostgreSQL/PostGIS 데이터베이스를 탐색하고 SQL로 공간 쿼리를 작성하는 방법을 배우려면 로컬에 설치하거나 클라우드에서 원격으로 사용할 수 있는 소프트웨어가 필요합니다.
zh_hans: 为了使用 PostgreSQL/PostGIS 数据库，以及学习使用 SQL 来进行空间查询，我们需要一些软件。这些软件可能安装在本机，也可能在云端。

source: There are instructions below on how to access PostgreSQL for installation on Windows or MacOS. PostgreSQL for Windows and MacOS either include PostGIS or have an easy way to add it on.
es: A continuación se muestran instrucciones sobre cómo acceder a PostgreSQL para instalar en Windows o MacOS. PostgreSQL para Windows o MacOS o incluye PostGIS directamente o disponen de una forma sencilla para añadir la extensión.
ko: Windows 또는 MacOS에 설치하기 위해 PostgreSQL에 액세스하는 방법에 대한 지침이 아래에 있습니다. Windows 및 MacOS용 PostgreSQL에는 PostGIS가 포함되어 있거나 쉽게 추가할 수 있습니다.
zh_hans: 下面会介绍在 Windows 或 MacOS 上如何安装 PostgreSQL 软件。无论是哪个系统上的 PostgreSQL，安装 PostGIS 是一件很简单的事情。

source: There are instructions below on how to install `PgAdmin <https://www.pgadmin.org/>`_. PgAdmin is a graphical database explorer and SQL editor which provides a "user facing" interface to the database engine that does all the world.
es: A continuación hay instrucciones para instalar `PgAdmin <https://www.pgadmin.org/>`_. PgAdmin es una interfaz gráfica y un editor SQL que permite a los usuarios interactuar con el motor de bases de datos, que es el que hace todo el trabajo.
ko: `PgAdmin <https://www.pgadmin.org/>`_ 설치 방법은 다음과 같습니다. PgAdmin은 그래픽 데이터베이스 탐색기 및 SQL 편집기로, 전 세계를 대상으로 하는 데이터베이스 엔진에 "사용자 대면" 인터페이스를 제공합니다.
zh_hans: 下面还会有关于如何安装 `PgAdmin <https://www.pgadmin.org/>`_ 软件。PgAdmin 是一个操作数据库的图形界面，提供了 SQL 代码编辑器。

source: For always up-to-date directions on installing PostgreSQL, go to the `PostgreSQL download page <https://www.postgresql.org/download/>`_ and select the operating system you are using.
es: Para acceder a unas instrucciones actualizadas de PostgreSQL, hay que ir a la `página de descarga de PostgreSQL <https://www.postgresql.org/download/>`_ y seleccionar el sistema operativo adecuado.
ko: PostgreSQL 설치에 대한 최신 지침을 보려면 `PostgreSQL 다운로드 페이지 <https://www.postgresql.org/download/>`_로 이동하여 사용 중인 운영 체제를 선택하십시오.
zh_hans: 不过，有关 PostgreSQL 的最新安装指南，还请看官方的 `下载页面 <https://www.postgresql.org/download/>`_，注意选择对应的操作系统。

source: PostgreSQL for Microsoft Windows
es: PostgreSQL para Microsoft Windows
ko: Microsoft Windows용 PostgreSQL
zh_hans: Windows 安装 PostgreSQL

source: For a Windows install:
es: Para una instalación en Windows:
ko: Windows 설치의 경우:
zh_hans: 在 Windows 中的安装步骤：

source: Go to the `Windows PostgreSQL download page <https://www.enterprisedb.com/downloads/postgres-postgresql-downloads>`_.
es: Ir a la `página de descarga de PostgreSQL para Windows <https://www.enterprisedb.com/downloads/postgres-postgresql-downloads>`_.
ko: `Windows PostgreSQL 다운로드 페이지 <https://www.enterprisedb.com/downloads/postgres-postgresql-downloads>`_로 이동합니다.
zh_hans: 打开 `Windows PostgreSQL 下载页 <https://www.enterprisedb.com/downloads/postgres-postgresql-downloads>`_。

source: Select the latest version of PostgreSQL and save the installer to disk.
es: Seleccionar la última versión de PostgreSQL y guardar el instalador en disco.
ko: 최신 버전의 PostgreSQL을 선택하고 설치 프로그램을 디스크에 저장합니다.
zh_hans: 选择最新版本的 PostgreSQL 并下载到硬盘中。

source: Run the installer and accept the defaults.
es: Ejecutar el instalador aceptando los valores por defecto.
ko: 설치 프로그램을 실행하고 기본값을 수락합니다.
zh_hans: 运行安装包并接受默认条款。

source: Find and run the "StackBuilder" program that was installed with the database.
es: Buscar y ejecutar el programa "StackBuilder" que se instaló con la base de datos.
ko: 데이터베이스와 함께 설치된 "StackBuilder" 프로그램을 찾아 실행합니다.
zh_hans: 打开随数据库安装好的 “StackBuilder” 程序。

source: Select the "Spatial Extensions" section and choose latest "PostGIS ..Bundle" option.
es: Seleccionar la sección "Spatial Extensions" y elegir la última opción "PostGIS ..Bundle".
ko: "Spatial Extensions" 섹션을 선택하고 최신 "PostGIS ..Bundle" 옵션을 선택합니다.
zh_hans: 展开 “Spatial Extensions” 部分，并勾选最新的 PostGIS 项。

source: Accept the defaults and install.
es: Aceptar los valores por defecto e instalar.
ko: 기본값을 수락하고 설치합니다.
zh_hans: 接受默认选项并安装。

source: PostgreSQL for Apple MacOS
es: PostgreSQL para Apple MacOS
ko: Apple MacOS용 PostgreSQL
zh_hans: MacOS 安装 PostgreSQL

source: For a MacOS install:
es: Para una instalación en MacOS:
ko: MacOS 설치의 경우:
zh_hans: 在 MacOS 的安装步骤：

source: Go to the `Postgres.app <https://postgresapp.com/>`_ site, and download the latest release.
es: Ir a la web de `Postgres.app <https://postgresapp.com/>`_ y descargar la última versión publicada.
ko: `Postgres.app <https://postgresapp.com/>`_ 사이트로 이동하여 최신 릴리스를 다운로드합니다.
zh_hans: 打开 `Postgres.app <https://postgresapp.com/>`_ 页面并下载最新的发行版。

source: Open the disk image, and drag the **Postgres** icon into the **Applications** folder.
es: Abrir la imagen de disco y arrastrar el icono **Postgres** a la carpeta **Aplicaciones**.
ko: 디스크 이미지를 열고 **Postgres** 아이콘을 **Applications** 폴더로 드래그합니다.
zh_hans: 打开磁盘镜像，拖拽 **Postgres** 图标到 **Applications** 文件夹。

source: In the **Applications** folder, double-click the **Postgres** icon to start the server.
es: En la carpeta **Aplicaciones**, hacer doble clic en el icono **Postgres** para arrancar el servidor.
ko: **Applications** 폴더에서 **Postgres** 아이콘을 두 번 클릭하여 서버를 시작합니다.
zh_hans: 在 **Application** 文件夹，双击 **Postgres** 图标启动数据库服务器。

source: Click the **Initialize** button to create a new blank database instance.
es: Hacer clic en el botón **Initialize** para crear una nueva instancia de base de datos en blanco.
ko: **초기화** 버튼을 클릭하여 빈 데이터베이스 인스턴스를 새로 만듭니다.
zh_hans: 点击 **Initialize** 按钮创建一个空白数据库实例。

source: In the **Applications** folder, go to the **Utilities** folder and open **Terminal**.
es: En la carpeta **Applications**, ir a la carpeta **Utilities** y abrir **Terminal**.
ko: **Applications** 폴더에서 **Utilities** 폴더로 이동하여 **Terminal**을 엽니다.
zh_hans: 在 **Applications** 文件夹，打开 **Utilities** 文件夹，然后在此打开终端。

source: Add the command-line utilities to your `PATH` for convenience.
es: Por comodidad, añadir la ruta a las utilidades de línea de comandos a tu `PATH`.
ko: 편의를 위해 `PATH`에 명령줄 유틸리티를 추가하세요.
zh_hans: 为方便起见，将下面的命令添加到 `PATH`中。

source: PgAdmin for Windows and MacOS
es: PgAdmin para Windows y MacOS
ko: Windows 및 MacOS용 PgAdmin
zh_hans: 在 Windows / MacOS 使用 PgAdmin

source: PgAdmin is available for multiple platforms, at https://www.pgadmin.org/download/.
es: PgAdmin está disponible para múltiples plataformas en https://www.pgadmin.org/download/.
ko: PgAdmin은 https://www.pgadmin.org/download/에서 여러 플랫폼에서 사용할 수 있습니다.
zh_hans: PgAdmin 是跨平台可用的，见 https://www.pgadmin.org/download/。

source: Download and install the latest version for your platform.
es: Descargar e instalar la última versión para tu plataforma.
ko: 플랫폼에 대한 최신 버전을 다운로드하여 설치합니다.
zh_hans: 为你的操作系统安装最新版的 PgAdmin。

source: Start PgAdmin!
es: ¡Arranca PgAdmin!
ko: PgAdmin을 시작하십시오!
zh_hans: 启动 PgAdmin！
