Repository: postgis/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/introduction.po
Languages: es, zh_hans

source: Introduction
es: Introducción
zh_hans: 介绍

source: What is a Spatial Database?
es: ¿Qué es una Base de Datos Espacial?
zh_hans: 什么是空间数据库？

source: PostGIS is a spatial database. Oracle Spatial and SQL Server (2008 and later) are also spatial databases. But what does that mean; what is it that makes an ordinary database a spatial database?
es: PostGIS es una base de datos espacial. Oracle Spatial y SQL Server (versiones de 2008 o posteriores) son también bases de datos espaciales. Pero, ¿eso qué quiere decir? ¿qué convierte a una base de datos normal en una base de datos espacial?
zh_hans: PostGIS 是一个空间数据库。Oracle Spatial 和 SQL Server（2008以及更新的版本）也有空间数据库。但是，具体是什么意思？如何让一个普通的数据库成为空间数据库？

source: The short answer, is...
es: La respuesta corta es ...
zh_hans: 简单的说，那就是：

source: **Spatial databases store and manipulate spatial objects like any other object in the database.**
es: **Las bases de datos espaciales almacenan y manipulan objetos espaciales como cualquier otro objeto en la base de datos.**
zh_hans: **空间数据库在数据库中，可以像操作普通数据一样操作空间数据对象。**

source: The following briefly covers the evolution of spatial databases, and then reviews three aspects that associate *spatial* data with a database -- data types, indexes, and functions.
es: A continuación, se repasa brevemente la evolución de las bases de datos espaciales y después se repasan tres aspectos de la asociación de datos *espaciales* con una base de datos -- tipos de dato, índices y funciones.
zh_hans: 下面将简要介绍空间数据库的发展，然后回顾将*空间*数据与数据库关联起来的三个方面——数据类型、索引和函数。

source: **Spatial data types** refer to shapes such as point, line, and polygon;
es: **Tipos de datos espaciales** se refiere a formas como punto, línea y polígono;
zh_hans: ** 空间数据类型** 用于表示点、线、面等几何形状;

source: Multi-dimensional **spatial indexing** is used for efficient processing of spatial operations;
es: **Indexado espacial** multi-dimensional que se usa para procesar operaciones espaciales de forma eficiente;
zh_hans: 多维**空间索引**用于提升空间数据处理的效率;

source: **Spatial functions**, posed in :term:`SQL`, are for querying of spatial properties and relationships.
es: **Funciones espaciales** en :term:`SQL`para consultar propiedades y relaciones espaciales.
zh_hans: **空间函数**，是定义在:term: ' SQL '中，用于处理空间属性和关系。

source: Combined, spatial data types, indexes, and functions provide a flexible structure for optimized performance and analysis.
es: Combinados, los tipos de dato espaciales, índices y funciones, proporcionan una estructura flexible para un rendimientos y análisis optimizados.
zh_hans: 空间数据类型、索引和函数相结合为优化性能和分析提供了灵活的结构。

source: In the Beginning
es: Al Principio
zh_hans: 开始

source: In legacy first-generation :term:`GIS` implementations, all spatial data is stored in flat files and special :term:`GIS` software is required to interpret and manipulate the data. These first-generation management systems are designed to meet the needs of users where all required data is within the user's organizational domain. They are proprietary, self-contained systems specifically built for handling spatial data.
es: En las antiguas implementaciones de :term:`GIS` de primera generación, todos los datos espaciales se almacenaban en ficheros simples y eran necesarios programas :term:`GIS` especiales para interpretar y manipular los datos. Estos sistemas de gestión de primera generación estaban diseñados para responder a las necesidades de usuarios que disponían de todos los datos necesarios dentro del ámbito de su propia organización. Se trataba de sistemas propietarios, auto-contenidos, construidos específicamente para manejar datos espaciales.
zh_hans: 在早期的第一代地理信息系统 :term:`GIS`实现中，所有的空间数据都存储在平面文件中，需要特殊的 :term:`GIS`软件来解释和操作这些数据。这些第一代的管理系统被设计用来满足用户的需求，其中所有需要的数据都在用户的组织领域内。它们是专门为处理空间数据而构建的专有、自包含的系统。

source: Second-generation spatial systems store some data in relational databases (usually the "attribute" or non-spatial parts) but still lack the flexibility afforded with direct integration.
es: Los sistemas espaciales de Segunda Generación almacenan parte de los datos en bases de datos relacionales (normalmente los "atributos" o las partes no-espaciales), pero aún le falta la flexibilidad de una integración directa.
zh_hans: 第二代空间系统将一些数据存储在关系数据库中（通常是“属性”或非空间部分），但仍然缺乏直接集成所提供的灵活性。

source: **True spatial databases were born when people started to treat spatial features as first class database objects.**
es: **Las auténticas bases de datos espaciales nacieron cuando se empezó a tratar a las entidades espaciales como objetos de la base de datos de "primera clase" **
zh_hans: **当人们开始将空间特性视为一等数据库对象时，真正的空间数据库就诞生了。**

source: Spatial databases fully integrate spatial data with a relational database. The system orientation changes from GIS-centric to database-centric.
es: Las bases de datos espaciales integran completamente los datos espaciales con una base de datos relacional. La orientación del sistema cambia de ser GIS-céntrico a ser BaseDeDatos-céntrico.
zh_hans: 空间数据库完全集成空间数据到一个关系型数据库。系统定位变化从GIS中心到数据库中心。

source: A spatial database management system may be used in applications besides the geographic world. Spatial databases are used to manage data related to the anatomy of the human body, large-scale integrated circuits, molecular structures, and electro-magnetic fields, among others.
es: Un sistema de gestión de bases de datos espacial se puede usar en aplicaciones más allá del mundo geográfico. Las bases de datos espaciales se usan para gestionar datos relacionados con la anatomía del cuerpo humano, circuitos integrados de gran escala, estructuras moleculares y campos electromagnéticos, entre otras aplicaciones.
zh_hans: 空间数据库管理系统可以用于地理世界之外的应用。空间数据库用于管理与人体解剖、大规模集成电路、分子结构和电磁场等相关的数据。

source: Spatial Data Types
es: Tipos de Datos Espaciales
zh_hans: 空间数据类型

source: An ordinary database has strings, numbers, and dates. A spatial database adds additional (spatial) types for representing **geographic features**. These spatial data types abstract and encapsulate spatial structures such as boundary and dimension. In many respects, spatial data types can be understood simply as shapes.
es: Una base de datos normal tiene cadenas, números y fechas. Una base de datos espacial añade tipos de datos adicionales para representar **entidades geográficas**. Estos tipos de dato abstraen y encapsulan estructuras espaciales tales como límites y dimesión. En muchos aspectos los tipos de datos espaciales se pueden entender simplemente como formas.
zh_hans: 普通数据库包含字符串、数字和日期。而空间数据库则添加了额外的（空间）类型，用于表示**地理要素**。这些空间数据类型对地理结构进行了抽象和封装，如边界和维度。在许多方面，空间数据类型可以简单地被理解为形状。

source: Spatial data types are organized in a type hierarchy. Each sub-type inherits the structure (attributes) and the behavior (methods or functions) of its super-type.
es: Los tipos de dato espacial están organizados en un tipo jerárquico. Cada sub-tipo hereda la estructura (atributos) y comportamiento (métodos o funciones) de su super-tipo.
zh_hans: 空间数据类型按类型层次结构进行组织。每个子类型都继承其超类型的结构（属性）和行为（方法或函数）。

source: Spatial Indexes and Bounding Boxes
zh_hans: 空间索引与边界范围框

source: An ordinary database provides **indexes** to allow for fast and random access to subsets of data. Indexing for standard types (numbers, strings, dates) is usually done with `B-tree <http://en.wikipedia.org/wiki/B-tree>`_ indexes.
es: Una base de datos normal proporciona **índices** para permitir un acceso rápido y aleatorio a subconjuntos de datos. El indexado para tipos estándar (números, cadenas y fechas) se hace normalmente con índices de tipo `B-tree <https://es.wikipedia.org/wiki/%C3%81rbol-B>`_.
zh_hans: 一个普通的数据库提供**索引**，以便快速和随机地访问数据的子集。对于标准类型（数字，字符串，日期）的索引通常使用`B-tree <http://en.wikipedia.org/wiki/B-tree>`_ 索引进行。

source: A B-tree partitions the data using the natural sort order to put the data into a hierarchical tree. The natural sort order of numbers, strings, and dates is simple to determine -- every value is less than, greater than or equal to every other value.
es: Un B-tree particiona los datos usando el ordenamiento natural para colocar los datos en un árbol jerárquico. El orden natural de números, cadenas y fechas es fácil de determinar -- cada valor es menor que, mayor que o igual a cada uno de los otros valores.
zh_hans: B树通过使用自然排序顺序将数据划分到层次树中。数字、字符串和日期的自然排序顺序很容易确定——每个值都小于、大于或等于其他任何值。

source: But because polygons can overlap, can be contained in one another, and are arrayed in a two-dimensional (or more) space, a B-tree cannot be used to efficiently index them. Real spatial databases provide a "spatial index" that instead answers the question "which objects are within this particular bounding box?".
es: Pero como los polígonos se pueden superponer, estar contenidos dentro de otros y están colocados en un espacio bidimensional (o de más dimensiones), un B-tree no se puede usar para indexarlos de forma eficiente. Las bases de datos espaciales proporcionan un "índice espacial" que responde a la pregunta "¿qué objetos están dentro de esta caja particular?".
zh_hans: 但是，由于多边形可以重叠，可以相互包含，并且在二维（或更多）空间中排列，因此无法使用B树有效地对它们进行索引。真正的空间数据库提供了一个“空间索引”，它回答的问题是“哪些对象在这个特定的边界框内？”。

source: A **bounding box** is the smallest rectangle -- parallel to the coordinate axes -- capable of containing a given feature.
es: Una **caja ('bounding box')** es el rectángulo más pequeño -- paralelo a los ejes de coordenadas -- capaz de contener una entidad dada.
zh_hans: **边界框**是能够包含给定要素的最小矩形，它与坐标轴平行。

source: Bounding boxes are used because answering the question "is A inside B?" is very computationally intensive for polygons but very fast in the case of rectangles. Even the most complex polygons and linestrings can be represented by a simple bounding box.
es: Las cajas se usan porque responder a la pregunta "¿está A dentro de B?" es muy costoso computacionalmente para polígonos pero muy rápido en el caso de rectángulos. E incluso los más complejos polígonos o líneas pueden ser representados por una simple caja.
zh_hans: 边界框的使用是因为回答“A是否在B内？”这个问题对于多边形来说计算量非常大，但对于矩形来说非常快。即使是最复杂的多边形和线条串也可以用一个简单的边界框来表示。

source: Indexes have to perform quickly in order to be useful. So instead of providing exact results, as B-trees do, spatial indexes provide approximate results. The question "what lines are inside this polygon?" will be instead interpreted by a spatial index as "what lines have bounding boxes that are contained inside this polygon's bounding box?"
es: Los índices tienen que responder rápidamente para ser útiles. Por eso, en vez de dar resultados exactos como hacen los B-trees, los índices espaciales dan resultados aproximados. La pregunta "¿qué lineas están dentro de este polígono?" interpretada por un índice espacial se reformularia como "¿qué lineas tienen cajas que están contenidas dentro de la caja de este polígono?".
zh_hans: 索引必须快速执行才能发挥作用。因此，空间索引提供的是近似结果，而不是像B树那样提供精确结果。"哪些线在这个多边形内部？"这个问题将被空间索引解释为"哪些线的边界框包含在这个多边形的边界框内？"

source: The actual spatial indexes implemented by various databases vary widely. The most common implementations are the `R-Tree <http://en.wikipedia.org/wiki/R-tree>`_ and `Quadtree <http://en.wikipedia.org/wiki/Quadtree>`_ (used in PostGIS), but there are also `grid-based indexes <http://en.wikipedia.org/wiki/Grid_(spatial_index)>`_ and `GeoHash indexes <https://en.wikipedia.org/wiki/Geohash>`_ implemented in other spatial databases.
es: Los tipos de índices espaciales implementados por distintas bases de datos varían mucho. Las implementaciones más comunes son el `Árbol-R (R-Tree) <https://es.wikipedia.org/wiki/%C3%81rbol-R>`_ y `Quadtree <https://es.wikipedia.org/wiki/Quadtree>`_ (usados en PostGIS), pero hay también `índices basados en grids <http://en.wikipedia.org/wiki/Grid_(spatial_index)>`_ e `indices GeoHash <https://en.wikipedia.org/wiki/Geohash>`_ implementados en otras bases de datos espaciales.
zh_hans: 各种数据库实现的实际空间索引差异很大。最常见的实现是`R-Tree <http://en.wikipedia.org/wiki/R-tree>`_和`Quadtree <http://en.wikipedia.org/wiki/Quadtree>`_ （在PostGIS中使用），但在其他空间数据库中也实现了 `格网索引<http://en.wikipedia.org/wiki/Grid_(spatial_index)>`_ 和`GeoHash索引 <https://en.wikipedia.org/wiki/Geohash>`_。这些都是为了更有效地处理空间数据查询。每种索引类型都有其优点和适用场景，因此在实际应用中需要根据具体需求选择合适的空间索引类型。

source: Spatial Functions
es: Funciones Espaciales
zh_hans: 空间函数

source: For manipulating data during a query, an ordinary database provides **functions** such as concatenating strings, performing hash operations on strings, doing mathematics on numbers, and extracting information from dates.
es: Para manipular datos en una consulta, una base de datos normal proporciona **funciones** tales como concatenar cadenas, aplicar operaciones de hash sobre cadenas, hacer cálculos matemáticos con números o extraer información de fechas.
zh_hans: 对于在查询过程中操作数据，普通数据库提供了一些**函数**，例如连接字符串，对字符串进行哈希操作，对数字进行数学运算，以及从日期中提取信息。这些函数可以帮助我们更有效地处理和操作数据。同样，空间数据库也提供了一系列的函数和方法，用于处理空间数据类型，如计算两个地理位置之间的距离，判断一个点是否在一个多边形内等。这些功能使得空间数据库在处理地理空间数据时更加强大和灵活。

source: A spatial database provides a complete set of functions for analyzing geometric components, determining spatial relationships, and manipulating geometries. These spatial functions serve as the building block for any spatial project.
es: Una bases de datos espacial proporciona un conjunto de funciones para analizar componentes geométricos, determinar relaciones espaciales y manipular geometrías. Estas funciones espaciales sirven de "ladrillos"para construir cualquier proyecto espacial.
zh_hans: 空间数据库提供了一整套函数，用于分析几何组件，确定空间关系和操作几何图形。这些空间函数充当任何空间项目的基础。

source: The majority of all spatial functions can be grouped into one of the following five categories:
es: La mayor parte de las funciones espaciales se pueden agrupar en una de las siguientes cinco categorías:
zh_hans: 大多数空间函数可以分为以下五类之一：

source: **Conversion**: Functions that *convert* between geometries and external data formats.
es: **Conversión**: Funciones que *convierten* entre geometrías y formatos de dato externos.
zh_hans: **转换**：将几何数据和外部数据格式之间进行*转换*的函数。

source: **Management**: Functions that *manage* information about spatial tables and PostGIS administration.
es: **Gestión**: Funciones que *gestionan* información sobre tablas espaciales y administración de PostGIS.
zh_hans: **管理**：用于*管理*空间表和PostGIS管理信息的函数。

source: **Retrieval**: Functions that *retrieve* properties and measurements of a Geometry.
zh_hans: **检索**：用于*检索*几何数据的属性和测量值的函数。

source: **Comparison**: Functions that *compare* two geometries with respect to their spatial relation.
es: **Comparación**: Funciones que *comparan* la relación espacial de dos geometrías.
zh_hans: **比较**：用于*比较*两个几何数据在空间关系上的函数。

source: **Generation**: Functions that *generate* new geometries from others.
es: **Generación**: Funciones que *generan* nuevas geometrías a partir de otras.
zh_hans: **生成**：从其他几何体 *生成* 新几何体的函数。

source: The list of possible functions is very large, but a common set of functions is defined by the :term:`OGC` :term:`SFSQL` and implemented (along with additional useful functions) by PostGIS.
es: La lista de posibles funciones es muy grande, pero hay un conjunto de funciones común, definido por el :term:`OGC` :term:`SFSQL` e implementado (junto con algunas funciones útiles más) por PostGIS.
zh_hans: 可能的函数列表非常大，但一组通用函数由 :term:`OGC` :term:`SFSQL` 定义并由 PostGIS 实现（以及其他有用的函数）。

source: What is PostGIS?
es: ¿Qué es PostGIS?
zh_hans: 什么是 PostGIS？

source: PostGIS turns the `PostgreSQL <http://www.postgresql.org/>`_ Database Management System into a spatial database by adding support for the three features: spatial types, spatial indexes, and spatial functions. Because it is built on PostgreSQL, PostGIS automatically inherits important "enterprise" features as well as open standards for implementation.
zh_hans: PostGIS 通过增加对空间类型、空间索引和空间函数这三个功能的支持，将 `PostgreSQL <http://www.postgresql.org/>`_ 数据库管理系统转变为空间数据库。因为它是基于PostgreSQL构建的，所以PostGIS会自动继承重要的“企业”功能以及开放的实施标准。

source: But what is PostgreSQL?
es: Pero, ¿qué es PostgreSQL?
zh_hans: 那什么是 PostgreSQL？

source: PostgreSQL is a powerful relational database management system (RDBMS). It is released under a BSD-style license and is thus free and open source software. As with many other open source programs, PostgreSQL is not controlled by any single company, but has a `global community of developers <https://www.postgresql.org/community/contributors/>`_ and companies to develop it.
es: PosgreSQL es un potente sistema gestor de bases de datos (SGBD, o RDBMS, por sus siglas en inglés). Se publica bajo una licencia parecida a la BSD y es por lo tanto software libre y de fuentes abiertas. Como sucede con muchos otros proyectos de fuentes abiertas, PostgreSQL no está controlado por una sola compañía, si no que cuenta con una `comunidad mundial de desarrolladores <https://www.postgresql.org/community/contributors/>`_ y compañías que lo desarrollan.
zh_hans: PostgreSQL 是一个强大的关系数据库管理系统 （RDBMS）。它是在BSD风格的许可证下发布的，因此是免费的开源软件。与许多其他开源程序一样，PostgreSQL不受任何一家公司的控制，而是拥有一个由开发人员和公司组成的 `全球开发社区<https://www.postgresql.org/community/contributors/>`_ 来开发它。

source: PostgreSQL was designed from the very start with type extension in mind -- the ability to add new data types, functions and indexes at run-time. Because of this, the PostGIS extension can be developed by a separate development team, yet still integrate very tightly into the core PostgreSQL database.
es: PostgreSQL fue diseñado desde el primer momento pensando en que se pudieran extender los tipos -- la habilidad de añadir nuevos tipos de datos, funciones e índices en tiempo de ejecución. Debido a esto, la extensión PostGIS puede ser desarrollada por un equipo de desarrollo distinto y aun así integrarse muy firmemente dentro del núcleo de la base de datos PostgreSQL.
zh_hans: PostgreSQL从一开始就考虑了类型扩展 - 能够在运行时添加新的数据类型，函数和索引。正因为如此，PostGIS扩展可以由一个单独的开发团队开发，但仍然能非常紧密地集成到核心PostgreSQL数据库中。

source: Why choose PostgreSQL?
es: ¿Por qué elegir PostgreSQL?
zh_hans: 为什么选择 PostgreSQL？

source: A common question from people familiar with open source databases is, "Why wasn't PostGIS built on MySQL?".
es: Una pregunta habitual entre la gente que usa bases de datos abiertas es, "¿por qué no se construyó PostGIS sobre MySQL?".
zh_hans: 熟悉开源数据库的人经常会问，“为什么不在 MySQL 上构建 PostGIS？”。

source: PostgreSQL has:
es: PostgreSQL tiene:
zh_hans: PostgreSQL 有：

source: Proven reliability and transactional integrity by default (ACID)
es: Una fiabilidad probada e integridad transaccional por defecto (ACID).
zh_hans: 默认具备经过验证的可靠性和事务完整性（ACID）

source: Careful support for SQL standards (full SQL92)
es: Soporte escrupuloso de los estándares SQL (SQL92 completo).
zh_hans: 对 SQL 标准的精心支持（完整的 SQL92）

source: Pluggable type extension and function extension
zh_hans: 插拔式扩展和功能扩展

source: Community-oriented development model
es: Modelo de desarrollo orientado a la comunidad.
zh_hans: 以社区为导向的发展模式

source: No limit on column sizes ("TOAST"able tuples) to support big GIS objects
zh_hans: 对列大小（“TOAST”支持元组）没有限制，以支持大型 GIS 对象

source: Generic index structure (GiST) to allow R-Tree index
es: Estructura de índices genéricos (GiST, por sus siglas en inglés) que permiten el índice R-Tree.
zh_hans: 通用索引结构 （GiST） 允许 R 树索引

source: Easy to add custom functions
es: Facilidad para añadir funciones personalizadas.
zh_hans: 易于添加自定义功能

source: Combined, PostgreSQL provides a very easy development path to add new spatial types. In the proprietary world, only `Illustra <https://en.wikipedia.org/wiki/Illustra>`_ (now Informix Universal Server) allowed such easy extension. This is no coincidence; Illustra is a proprietary re-working of the original PostgreSQL code base from the 1980's.
zh_hans: 综合而言，PostgreSQL 提供了一种非常简单的开发路径来添加新的空间类型。在专有领域，只有 `Illustra <https://en.wikipedia.org/wiki/Illustra>`_（现在的 Informix Universal Server）允许如此简单的扩展。这并非巧合;Illustra 是对 1980 年代原始 PostgreSQL 代码库的专有重新编制版本。

source: Because the development path for adding types to PostgreSQL was so straightforward, it made sense to start there. When MySQL released basic spatial types in version 4.1, the PostGIS team took a look at their code, and the exercise reinforced the original decision to use PostgreSQL.
es: Dado que la forma de desarrollar nuevos tipos en PostgreSQL era tan clara, tenía sentido empezar por allí. Cuando MySQL lanzó tipos espaciales básicos en su versión 4.1, el equipo de PostGIS le echó un vistazo a su código y dicho ejercicio no hizo si no reforzar la decisión original de elegir PostgreSQL.
zh_hans: 由于向PostgreSQL添加类型的开发路径非常直接，从那里开始是合理的。当MySQL在4.1版本中发布基本的空间类型时，PostGIS团队审查了他们的代码，这个过程强化了最初选择使用PostgreSQL的决定。

source: Because MySQL spatial objects had to be hacked on top of the string type as a special case, the MySQL code was spread over the entire code base. Development of PostGIS 0.1 took under a month. Doing a "MyGIS" 0.1 would have taken a lot longer, and as such, might never have seen the light of day.
zh_hans: 由于MySQL空间对象必须作为一种特例添加到字符串类型之上，MySQL的代码分散在整个代码库中。PostGIS 0.1的开发在不到一个月的时间内完成。要创建一个"MyGIS" 0.1可能需要更长时间，因此可能永远不会面世。

source: Why not files?
es: ¿Por qué no ficheros?
zh_hans: 为什么不用文件？

source: The `Shapefile <http://en.wikipedia.org/wiki/Shapefile>`_ (and other formats like the Esri File Geodatabase and the `GeoPackage <https://www.geopackage.org/>`_) have been a standard way of storing and interacting with spatial data since GIS software was first written. However, these "flat" files have the following disadvantages:
es: Los `Shapefile <http://es.wikipedia.org/wiki/Shapefile>`_ (y otros formatos como los archivos de Esri Geodatabase y los `GeoPackage <https://www.geopackage.org/>`_) han sido una forma estándar de almacenar e interaccionar con información espacial desde los primeros programas GIS. No obstante, estos ficheros "planos" tienen las siguientes desventajas:
zh_hans: 自从 GIS 软件开发以来，`Shapefile <http://en.wikipedia.org/wiki/Shapefile>`_（以及 Esri File Geodatabase、`GeoPackage <https://www.geopackage.org/>`_ 等其他格式）一直是存储空间数据、访问空间数据的标准格式。但是，这些“单一”的文件格式有以下缺点：

source: **Files require special software to read and write.** SQL is an abstraction for random data access and analysis. Without that abstraction, you will need to write all the access and analysis code yourself.
es: **Los archivos necesitan un software especial para leerlos y escribirlos.** SQL es una abstracción para acceso aleatorio a datos y análisis. Sin esa abstracción, tendrías que escribir todo el código para acceder y analizar por tí mismo.
zh_hans: **文件需要特殊的软件才能读取和写入。** SQL 是随机数据访问和分析的抽象。如果没有这种抽象，您将需要自己编写所有访问和分析代码。

source: **Concurrent users can cause corruption and slowdowns.** While it's possible to write extra code to ensure that multiple writes to the same file do not corrupt the data, by the time you have solved the problem and also solved the associated performance problem, you will have written the better part of a database system. Why not just use a standard database?
es: **Usuarios/as concurrentes pueden causar corrupción de archivos y ralentización**. Aunque es posible escribir código que asegure que múltiples escrituras en el mismo fichero no corrompan los datos, para cuando se haya solucionado ese problema y también el problema asociado del rendimiento, nos encontraremos con que se habrá escrito gran parte de lo que constituye un sistema de bases de datos. Entonces, ¿por qué no usar una base de datos estándar?
zh_hans: **并发用户可能会导致损坏和速度变慢。** 虽然可以编写额外的代码来确保对同一文件的多次写入不会损坏数据，但当您解决了问题并解决了相关的性能问题时，您将编写了数据库系统更好的部分。为什么不直接使用标准数据库呢？
