Repository: postgis/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/introduction.po
Languages: es, zh_hans

source: **Complicated questions require complicated software to answer.** Complicated and interesting questions (spatial joins, aggregations, etc) that are expressible in one line of SQL in the database take hundreds of lines of specialized code to answer when programming against files.
es: **Preguntas complicadas necesitan software complicado para responderlas**. Las perguntas complicadas e interesantes (uniones espaciales, agresgaciones, etc) que se pueden expresar en una linea de SQL en la base de datos llevan cientos de lineas de código especializado cuando se programa para utilizar archivos.
zh_hans: **复杂的问题需要复杂的软件来回答。** 复杂而有趣的问题（空间联接、聚合等）可以在数据库中的一行 SQL 中表达，在针对文件进行编程时需要数百行专用代码来回答。

source: Most users of PostGIS are setting up systems where multiple applications will be expected to access the data, so having a standard SQL access method simplifies deployment and development. Some users are working with large data sets; with files, they might be segmented into multiple files, but in a database they can be stored as a single large table.
zh_hans: PostGIS 的大多数用户正在设置多个应用程序访问数据的系统，因此拥有标准的 SQL 访问方法可以简化部署和开发。一些用户正在处理大型数据集;对于文件，它们可能会被分割成多个文件，但在数据库中，它们可以存储为单个大表。

source: In summation, the combination of support for multiple users, complex ad hoc queries, and performance on large data sets are what sets spatial databases apart from file-based systems.
es: En resumen, la combinación del soporte para múltiples usuarios, consultas *ad hoc* complejas y rendimiento sobre conjuntos de datos grandes son lo que hace la diferencia entre bases de datos espaciales y sistemas basados en archivos.
zh_hans: 总的来说，对多用户的支持、复杂的临时查询以及在大型数据集上的性能是使空间数据库与基于文件的系统有所区别的关键因素。

source: A brief history of PostGIS
es: Una breve historia de PostGIS
zh_hans: PostGIS 的简单历史

source: In the May of 2001, `Refractions Research <http://www.refractions.net/>`_ released the first version of PostGIS. PostGIS 0.1 had objects, indexes and a handful of functions. The result was a database suitable for storage and retrieval, but not analysis.
es: En mayo de 2001, `Refractions Research <http://www.refractions.net/>` lanzó la primera versión de PostGIS. PostGIS 0.1 tenía objetos, índices y un puñado de funciones. El resultado fue una base de datos capaz de almacenar y recuperar, pero no de analizar.
zh_hans: 2001 年 5 月，`Refractions Research <http://www.refractions.net/>`_ 发布了 PostGIS 的第一版。PostGIS 0.1 拥有对象、索引和一些趁手的函数。那时，它只是适合存储数据和检索数据，并不适合分析数据。

source: As the number of functions increased, the need for an organizing principle became clear. The "Simple Features for SQL" (:term:`SFSQL`) specification from the Open Geospatial Consortium provided such structure with guidelines for function naming and requirements.
es: Según aumentaba el número de funciones, se fue haciendo clara la necesidad de un principio organizador. La especificación "Simple Features for SQL" (:term:`SFSQL`) del Open Geospatial Consortium proporcionó esa estructura con guías para nombrar las funciones y requerimientos.
zh_hans: 随着函数数量的增加，对组织原则的需求变得明显。开放地理空间联盟（Open Geospatial Consortium）的"Simple Features for SQL"（简称 :term:`SFSQL`）规范提供了这样的结构，其中包括函数命名和要求的指南。

source: With PostGIS support for simple analysis and spatial joins, `Mapserver <http://mapserver.org/>`_ became the first external application to provide visualization of data in the database.
es: Con el apoyo de PostGIS para analisis simples y uniones espaciales, `Mapserver <http://mapserver.org/>`_ se convirtió en la primera apliacción externa en proporcionar una visualización de los datos en la base de datos.
zh_hans: 随着PostGIS对简单分析和空间连接的支持，`Mapserver <http://mapserver.org/>`_ 成为第一个外部应用程序，为数据库中的数据提供可视化展示。

source: Over the next several years the number of PostGIS functions grew, but its power remained limited. Many of the most interesting functions (e.g., ST_Intersects(), ST_Buffer(), ST_Union()) were very difficult to code. Writing them from scratch promised years of work.
es: En los siguientes años el número de funciones de PostGIS creció, pero su potencia siguió limitada. Muchas de las funciones más interesantes (p. ej. ST_Intersects(), ST_Buffer(), ST_Union()) eran muy difíciles de programar. Escribirlas de cero podía llevar años de trabajo.
zh_hans: 在接下来的几年里，PostGIS功能的数量不断增长，但其功能仍然有限。许多最有趣的函数（例如，ST_Intersects（）、ST_Buffer（）、ST_Union（））都很难编码。从头开始编写它们需要多年的工作。

source: Fortunately a second project, the "Geometry Engine, Open Source" or `GEOS <http://trac.osgeo.org/geos>`_, came along. The GEOS library provides the necessary algorithms for implementing the :term:`SFSQL` specification. By linking in GEOS, PostGIS provided complete support for :term:`SFSQL` by version 0.8.
es: Por suerte, un segundo proyecto, "Geometry Engine, Open Source" or `GEOS <http://trac.osgeo.org/geos>`_ apareció en ese momento. La biblioteca GEOS ofrece los algoritmos necesarios para implementar la especificación :term:`SFSQL`. Enlazando con GEOS, PostGIS consiguió dar un soporte completo para :term:`SFSQL` a partir de la versión 0.8.
zh_hans: 幸运的是，第二个项目——"Geometry Engine, Open Source" 或 `GEOS <http://trac.osgeo.org/geos>`_，也随之出现。GEOS库提供了实现 :term:`SFSQL` 规范所需的算法。通过引入GEOS，PostGIS在版本0.8中为 :term:`SFSQL` 提供了完整的支持。

source: As PostGIS data capacity grew, another issue surfaced: the representation used to store geometry proved relatively inefficient. For small objects like points and short lines, the metadata in the representation had as much as a 300% overhead. For performance reasons, it was necessary to put the representation on a diet. By shrinking the metadata header and required dimensions, overhead greatly reduced. In PostGIS 1.0, this new, faster, lightweight representation became the default.
es: Según crecía la capacidad de gestión de datos, apareció otro problema: la representación que se usaba para almacenar las geometrías se demostró relativamente ineficiente. Para objetos pequeños como puntos y lineas cortas, los metadatos de la representación llegaban a tener una sobrecarga del 200%. Por motivos de eficiencia era necesario "poner en dieta" la representación. Encogiendo el cabecero de los metadatos y las dimensiones necesarias se redujo mucho la sobrecarga. En PostGIS 1.0, esta representación nueva, más rápida y ligera se había convertido en la opción por defecto.
zh_hans: 随着PostGIS数据容量的增长，出现了另一个问题：用于存储几何信息的表示方式相对低效。对于小型对象，如点和短线，表示中的元数据可能会有高达300%的额外开销。出于性能原因，有必要对表示进行精简。通过缩小元数据头和所需的维度，额外开销大大减少。在PostGIS 1.0中，这种新的、更快速、轻量级的表示方式成为了默认选项。

source: Recent releases of PostGIS continue to add features and performance improvements, as well as support for new features in the PostgreSQL core system.
es: Los lanzamientos recientes de PostGIS siguen añadiendo funcionalidades y mejoras de rendimiento, así como añadiendo soporte para nuevas funcionalidades del sistema central de PostgreSQL.
zh_hans: 最新版本的 PostGIS 继续添加功能和性能改进，以及对 PostgreSQL 核心系统中新功能的支持。

source: Who uses PostGIS?
es: ¿Quién usa PostGIS?
zh_hans: 谁在用 PostGIS？

source: For a complete list of case studies, see the `PostGIS case studies <https://postgis.net/category/casestudy/>`_ page.
zh_hans: 有关案例研究的完整列表，请参阅`PostGIS案例研究 <https://postgis.net/category/casestudy/>`_ 页面。

source: Institut Geographique National, France
es: Instituto Geográfico Nacional, Francia.
zh_hans: 法国国家地理研究所

source: IGN is the national mapping agency of France, and uses PostGIS to store the high resolution topographic map of the country, "BDUni". BDUni has more than 100 million features, and is maintained by a staff of over 100 field staff who verify observations and add new mapping to the database daily. The IGN installation uses the database transactional system to ensure consistency during update processes, and a `warm standby system <https://www.postgresql.org/docs/devel/warm-standby.html>`_ to maintain uptime in the event of a system failure.
zh_hans: IGN是法国的国家测绘机构，使用PostGIS来存储该国的高分辨率地形图“BDUni”。BDUni 拥有超过 1 亿个特征，由 100 多名现场工作人员维护，他们每天验证观测结果并向数据库添加新的地图。IGN 安装使用数据库事务系统来确保更新过程中的一致性，并使用 `热备用 <https://www.postgresql.org/docs/devel/warm-standby.html>`_ 系统在系统发生故障时保持正常运行时间。

source: `RedFin <https://www.redfin.com>`_ is a real estate agency with a web-based service for exploring properties and estimate values. Their system was originally built on MySQL, but they found that moving to PostgreSQL and PostGIS provided `huge benefits in performance and reliability <https://www.redfin.com/news/elephant_versus_dolphin_which_is_faster_which_is_smarter/>`_.
zh_hans: `RedFin <https://www.redfin.com>`_ 是一家房地产代理公司，提供基于网络的服务，用于探索房产和估算价值。他们的系统最初是建立在MySQL上的，但他们发现迁移到PostgreSQL和PostGIS `在性能和可靠性方面提供了巨大好处 <https://www.redfin.com/news/elephant_versus_dolphin_which_is_faster_which_is_smarter/>`_。

source: What applications support PostGIS?
es: ¿Qué aplicaciones soportan PostGIS?
zh_hans: 什么应用软件支持 PostGIS？

source: PostGIS has become a widely used spatial database, and the number of third-party programs that support storing and retrieving data using it has increased as well. The `programs that support PostGIS <http://trac.osgeo.org/postgis/wiki/UsersWikiToolsSupportPostgis>`_ include both open source and proprietary software on both server and desktop systems.
es: PostGIS se ha convertido en una base de datos espacial ampliamente usada y el número de terceros programas que lo utilizan para almacenamiento y recuperación de datos se ha incrementado también. Los `programas que utilizan PostGIS <http://trac.osgeo.org/postgis/wiki/UsersWikiToolsSupportPostgis>`_ incluyen tanto software libre como propietario en sistemas de servidor o de escritorio.
zh_hans: PostGIS已成为一个广泛使用的空间数据库，支持使用它存储和检索数据的第三方程序的数量也有所增加。`支持PostGIS的程序<http://trac.osgeo.org/postgis/wiki/UsersWikiToolsSupportPostgis>`_ 包括服务器和桌面系统上的开源软件和专有软件。

source: The following table shows a list of some of the software that leverages PostGIS:
es: La siguiente tabla muestra una lista de algunos de los programas que utilizan PostGIS:
zh_hans: 下表显示了一些支持PostGIS 的软件列表：

source: Open/Free
es: Abiertos/Libres
zh_hans: 开源/自由

source: Closed/Proprietary/Paid services
zh_hans: 封闭式/专有/付费服务

source: Loading/Extracting
es: Carga/Extracción
zh_hans: 加载/解析

source: Web-Based
es: Basados en Web
zh_hans: Web 端

source: MapGuide Open Source (using FDO)
es: MapGuide Open Source (usando FDO).
zh_hans: MapGuide Open Source (使用 FDO)

source: Desktop
es: Escritorio
zh_hans: 桌面端

source: Services / DbaaS
zh_hans: 服务 / 数据库即服务

source: For a complete list of case studies, see the `PostGIS case studies <http://postgis.net/casestudy>`_ page.
es: Para una lista completa de casos de estudio mirar la página `PostGIS case studies <http://postgis.net/casestudy>`_.

source: `RedFin <https://www.redfin.com>`_ is a real estate agency with a web-based service for exploring properties and estimate values. Their system was originally build on MySQL, but they found that moving to PostgreSQL and PostGIS provided `huge benefits in performance and reliability <https://www.redfin.com/news/elephant_versus_dolphin_which_is_faster_which_is_smarter/>`_.
es: `RedFin <https://www.redfin.com>`_ es una agencia inmobiliaria con un servicio web para explorar propiedades y estimar su valor. Su sistema fue originalmente construido sobre MySQL, pero vieron que moverlo a PostgreSQL y PostGIS proporcionaba `grandes beneficios en rendimiento y fiabilidad <https://www.redfin.com/news/elephant_versus_dolphin_which_is_faster_which_is_smarter/>`_.

source: Closed/Proprietary
es: Cerrados/Propietarios

source: GeoServer (Java-based WFS / WMS -server )
es: GeoServer ( WFS / WMS servidor basado en Java ).

source: SharpMap SDK - for ASP.NET 2.0
es: SharpMap SDK - para ASP.NET 2.0.

source: SharpMap SDK for Microsoft.NET 2.0
es: SharpMap SDK para Microsoft.NET 2.0.

source: ZigGIS for ArcGIS/ArcObjects.NET
es: ZigGIS para ArcGIS/ArcObjects.NET.

source: Safe FME Desktop Translator/Converter
es: Safe FME Desktop Traductor/Convertidor.

source: Ionic Red Spider (now ERDAS)
es: Ionic Red Spider (ahora ERDAS).

source: MapGuide Enterprise (using FDO)
es: MapGuide Enterprise (usando FDO).

source: AutoCAD Map 3D (using FDO)
es: AutoCAD Map 3D (usando FDO)
